#### One hot encoding

In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
pd.get_dummies(df['Sex'],drop_first=True)

     male
0       1
1       0
2       0
3       0
4       1
..    ...
886     1
887     0
888     0
889     1
890     1

[891 rows x 1 columns]

In [4]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [5]:
df.dropna(inplace=True)

In [6]:
df['Embarked'].unique()

array(['C', 'S', 'Q'], dtype=object)

In [7]:
pd.get_dummies(df['Embarked'],drop_first=True)
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

#### Ordinal Number Encoding

In [8]:
import datetime

In [9]:
today_date=datetime.datetime.today()

In [10]:
today_date-datetime.timedelta(5)

datetime.datetime(2023, 4, 12, 20, 6, 17, 937820)

In [11]:
days=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [12]:
import pandas as pd
data=pd.DataFrame(days)
data.columns=['Day']

In [13]:
data.head()

                         Day
0 2023-04-17 20:06:17.937820
1 2023-04-16 20:06:17.937820
2 2023-04-15 20:06:17.937820
3 2023-04-14 20:06:17.937820
4 2023-04-13 20:06:17.937820

In [14]:
data["weekday"]=data["Day"].dt.day_name()

In [15]:
data.head()

                         Day   weekday
0 2023-04-17 20:06:17.937820    Monday
1 2023-04-16 20:06:17.937820    Sunday
2 2023-04-15 20:06:17.937820  Saturday
3 2023-04-14 20:06:17.937820    Friday
4 2023-04-13 20:06:17.937820  Thursday

In [16]:
dictionary={'Monday':1, 'Tuesday':2,'Wednusday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7}

In [17]:
data['weekday_ordinal']=data['weekday'].map(dictionary)

In [18]:
data.head()

                         Day   weekday  weekday_ordinal
0 2023-04-17 20:06:17.937820    Monday              1.0
1 2023-04-16 20:06:17.937820    Sunday              7.0
2 2023-04-15 20:06:17.937820  Saturday              6.0
3 2023-04-14 20:06:17.937820    Friday              5.0
4 2023-04-13 20:06:17.937820  Thursday              4.0

#### Count or Frequency Encoding

In [19]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [20]:
columns=[1,3,5,6,7,8,9,13]

In [21]:
train_set=train_set[columns]

In [22]:
train_set.columns=['Employment','Degree','Status','Designation','family','Race','sex','country']

In [23]:
train_set.head()

,Employment,Degree,Status,Designation,family,Race,sex,country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [24]:
for feature in train_set.columns[:]:
    print(feature,":",len(train_set[feature].unique()),'labels')

Employment : 9 labels
Degree : 16 labels
Status : 7 labels
Designation : 15 labels
family : 6 labels
Race : 5 labels
sex : 2 labels
country : 42 labels

In [25]:
contry_map=train_set['country'].value_counts().to_dict()

In [26]:
train_set['country']=train_set['country'].map(contry_map)

In [27]:
train_set.head()

,Employment,Degree,Status,Designation,family,Race,sex,country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95

#### Target guided ordinal Encoding

In [28]:
import pandas as pd

In [29]:
df=pd.read_csv('titanic.csv',usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [30]:
df['Cabin'].fillna('Missing',inplace=True)

In [31]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [32]:
df.Cabin.unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [33]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [34]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [35]:
ordinal_label=df.groupby(['Cabin'])['Survived'].mean().sort_values().index
ordinal_label

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [36]:
enumerate(ordinal_label)

In [37]:
ordinal_label2={k:i for i,k in enumerate(ordinal_label,0)}
ordinal_label2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [38]:
df['cabin_ordinal_label']=df['Cabin'].map(ordinal_label2)

In [39]:
df['cabin_ordinal_label'].head()

0    1
1    4
2    1
3    4
4    1
Name: cabin_ordinal_label, dtype: int64

#### Mean Encoding

In [40]:
mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [41]:
mean_ordinal_cabin=df['Cabin'].map(mean_ordinal)

In [42]:
mean_ordinal_cabin.head(10)

0    0.299854
1    0.593220
2    0.299854
3    0.593220
4    0.299854
5    0.299854
6    0.750000
7    0.299854
8    0.299854
9    0.299854
Name: Cabin, dtype: float64

#### Probability Ratio Encoding

In [1]:
import pandas as pd
df=pd.read_csv('titanic.csv',usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [2]:
df['Cabin'].fillna('Missing', inplace=True)
df.head()

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing

In [3]:
df['Cabin'].unique()

array(['Missing', 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [4]:
df['Cabin'].astype(str).str[0]

0      M
1      C
2      M
3      C
4      M
      ..
886    M
887    B
888    M
889    C
890    M
Name: Cabin, Length: 891, dtype: object

In [5]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A10        0.000000
A14        0.000000
A16        1.000000
A19        0.000000
A20        1.000000
             ...
F38        0.000000
F4         1.000000
G6         0.500000
Missing    0.299854
T          0.000000
Name: Survived, Length: 148, dtype: float64

In [6]:
prob_df=df.groupby(['Cabin'])['Survived'].mean()

In [8]:
prob_df.head()

Cabin
A10    0.0
A14    0.0
A16    1.0
A19    0.0
A20    1.0
Name: Survived, dtype: float64

In [9]:
prob_df=pd.DataFrame['prob_df']

TypeError: 'type' object is not subscriptable